[["0",{"pageContent":"5 simple steps to build executive buy-in for new technology\r\nIs your organization considering a new software purchase? If you’re like most enterprise level associations, you likely have an in-depth process to get executive approval for any technology investments. \r\n\r\nIt can be a challenge obtaining executive buy-in for new association management software (AMS). Follow the steps in our blog to create a culture of change management and gain executive buy-in for new technology.  \r\nHow to build executive buy-in for new association management software\r\n\r\nChange is a process. And gaining executive support and buy-in for new association management software will take time.\r\n\r\nMake the process smoother by creating a culture of change management and following these five steps:  \r\n\r\n1. Follow best practices\r\nLay the groundwork for new technology by applying change management best practices. Start by assessing your association’s current needs and determining how a new AMS can bridge the gap.","metadata":{"loc":{"lines":{"from":1,"to":12}}}}],["1",{"pageContent":"Lay the groundwork for new technology by applying change management best practices. Start by assessing your association’s current needs and determining how a new AMS can bridge the gap.\r\n\r\nConsider your organizational priorities and decide which capabilities you’ll need in your next system. Does your association require an AMS that integrates, syncs data, has dependable application architecture, and offers continuous upgrades and innovation? Determining your current needs and how new technology can support your goals will help your organization set the scene for change.\r\n\r\n“You want to start by putting together a work plan to help you understand the first steps for your project. Take time to determine the things you like about your current AMS—what works and what doesn’t. And decide what you’d like to see in your new AMS. Having this framework for your project team and decision makers will help you along in the process,” said Mauren Joudrey of the Council on Foundations (COF).","metadata":{"loc":{"lines":{"from":12,"to":16}}}}],["2",{"pageContent":"2. Create a mission statement\r\nLeverage your software business case to develop a change management mission statement. In your mission statement, share why your organization needs a new AMS by highlighting current organizational pain points and detailing the shortcomings of your current software. \r\n\r\nStress that now is the time for change and clarify the risks of not acting. Does your association risk falling behind industry competition? Perhaps your organization experiences data silos or staff and member retention issues. Detail how new technology can alleviate these pain points.\r\n3. Emphasize software benefits\r\nTo go beyond the numbers and show executives how a new AMS can support your mission and goals, try highlighting the benefits of new technology rather than its features. Clarify what leadership can gain from a new AMS. For example, show how user-friendly reporting and dashboards can empower executives to make better decisions to meet organizational goals.","metadata":{"loc":{"lines":{"from":18,"to":23}}}}],["3",{"pageContent":"Additionally, focus on the numerous benefits a new AMS can offer for your staff and members. For example, showcase how the new software can simplify staff processes and enhance both the staff and member experience.\r\n\r\n“When it comes to creating a business case, it can be easy to focus on numbers. How much will it cost? How are you going to finance it? What’s the return on investment? Instead, I would recommend approaching it theoretically. Focus on how you’re going to grow members or how you’re going to hit goals with your new software,” said Natasha Rocheleau of the Society of American Military Engineers (SAME).\r\n\r\n4. Work with a consultant \r\nWorking with an AMS selection consultant offers multiple benefits. An AMS selection consultant simplifies the process of researching new technology and presenting your case to executives. Working with a consultant can also help you establish a culture of change management and prepare your organization for the unexpected.","metadata":{"loc":{"lines":{"from":25,"to":30}}}}],["4",{"pageContent":"AMS selection consultants help you build a case for why you need new software and determine the best AMS to meet your organizational pain points. Not only do consultants offer industry insights into the best technology, but they also have relationships with all leading AMS vendors to help you ask tough questions about how an AMS can best support your organization.  \r\n\r\n5. Focus on solutions \r\nWhen it’s finally time to address executives, show confidence as you present your mission statement with your case for new technology. You’ve done your research about the new AMS, you’ve created a mission statement, and you‘re ready to offer your case for new software. \r\n \r\nAs you meet with executives, focus on solutions rather than offering more problems, and demonstrate how a new AMS can support staff and members, as well as alleviate organizational pain points.","metadata":{"loc":{"lines":{"from":32,"to":37}}}}],["5",{"pageContent":"As you meet with executives, focus on solutions rather than offering more problems, and demonstrate how a new AMS can support staff and members, as well as alleviate organizational pain points. \r\n\r\n“When talking to executives, try striking a balance in providing the right amount of information about your new software. Providing too much information can weigh executives down and can potentially prompt more questions. Answer why you need new software and how the new software will support your organization. Also, prepare your team members to answer specific questions that will likely be asked by executives,” said Rocheleau of SAME.\r\n\r\n\r\nresource : https://www.nimbleams.com/blog/build-executive-buy-in/","metadata":{"loc":{"lines":{"from":37,"to":42}}}}],["6",{"pageContent":"7 ways to increase volunteer engagement\r\nIs your association looking for tips to drive volunteer engagement? Perhaps your volunteer program has plenty of recruits, but you’re looking for strategies to create meaningful member experiences?   \r\n\r\nWhen you prioritize volunteer engagement, your volunteer program benefits, and so does your organization’s bottom line. Volunteers have the power to save your association time and money. According to AmeriCorps, Americans volunteered an average of 7.8 billion hours. AmeriCorps estimates the industry of volunteerism to be worth $184 billion. \r\n\r\nIt’s crucial to invest in your volunteer engagement strategy and keep volunteers happy, motivated, and committed to the work they do for your organization. Ultimately, the level of volunteer engagement will impact your association’s ability to retain and develop volunteers. Read our blog for tips to boost volunteer engagement today! \r\nWhat is an effective volunteer engagement strategy?","metadata":{"loc":{"lines":{"from":1,"to":7}}}}],["7",{"pageContent":"What is an effective volunteer engagement strategy?  \r\nTo create a successful volunteer engagement strategy and foster worthwhile volunteer opportunities, you’ll want to prioritize collaboration between your volunteers and staff. These volunteer opportunities will not only positively impact your association, but they’ll benefit your profession and industry. When developing your volunteer engagement strategy, attempt to match your volunteers with opportunities that provide valuable experiences.\r\n\r\nHow can technology boost volunteer engagement?","metadata":{"loc":{"lines":{"from":7,"to":10}}}}],["8",{"pageContent":"How can technology boost volunteer engagement?\r\nHaving the right tools can make volunteer engagement easy. If your organization wants to create a successful volunteer experience, you’ll want to adopt modern association management software (AMS). Look for an AMS that makes it simple for members to browse and apply for volunteer opportunities. Modern technology should also help your staff streamline the management of volunteer jobs and shifts, so members can easily see how much they’ve contributed to a volunteer project or team. \r\n\r\nTECH TIP: Take volunteer engagement to the next level with Nimble AMS. The Nimble AMS volunteer management functionality helps you share news about volunteer opportunities and boost engagement with easy browsing and volunteer application features. Nimble AMS also streamlines staff processes by tracking volunteer jobs and shifts for members.\r\n7 strategies to boost volunteer engagement","metadata":{"loc":{"lines":{"from":10,"to":14}}}}],["9",{"pageContent":"7 strategies to boost volunteer engagement \r\nNow that you know why a volunteer engagment strategy is crucial to maintaining your volunteer program, it’s time to get started offering valuable member experiences. Here’s how: \r\n1. Survey your volunteers\r\nTo provide a worthwhile experience for your volunteers and begin implementing your volunteer engagement strategy, you’ll need to seek member feedback. The easiest way is to conduct a survey. With a volunteer survey, you can gain statistically beneficial answers, while simultaneously empowering members and bolstering your retention efforts.   \r\n\r\nWith a good survey, you can impact the effectiveness of volunteer orientation, training, recruitment, and retention. Before you create your survey, consider how you’ll get volunteers to participate.\r\n\r\nTry the following methods to increase volunteer responses in your survey:","metadata":{"loc":{"lines":{"from":14,"to":21}}}}],["10",{"pageContent":"Try the following methods to increase volunteer responses in your survey: \r\n\r\nExplain the benefits. In the survey introduction, share how it will help the volunteer program provide better opportunities for its participants. Explain that when volunteers offer honest feedback, you’ll be able to match them in the perfect experience.\r\nMake the survey anonymous. If you seek your volunteer’s honesty, consider making the survey anonymous. You’re less likely to get their authentic feedback if you make them submit their names.\r\nOffer an incentive. Consider purchasing a small gift card and randomly selecting a winner from those who complete the survey.\r\nBuild hype. Promote your survey in multiple locations – through emails, on your association website, and on social media. Always include a call to action, which features a link to the survey location.","metadata":{"loc":{"lines":{"from":21,"to":26}}}}],["11",{"pageContent":"Keep it short. While you may have a lot of questions for your volunteers, best practice is to keep your surveys short. You can always conduct a follow up survey in the future.\r\n\r\nQuestions to include in your survey \r\nWhen compiling your first volunteer survey, consider beginning it with basic demographic data to provide a helpful foundation before delving into the meat of your survey. Try including the following:  \r\n\r\nDemographic data  \r\nAvailability and scheduling  \r\nWhat skills do you have?  \r\nWhat are your interests?  \r\nDescribe why you first wanted to volunteer at the association.  \r\nWhat motivates you to volunteer with our association?  \r\n\r\nBecause your association wants volunteer engagement, the primary focus of the remaining survey should be on volunteer motivation. Consider asking questions like:  \r\n\r\nHow would you rate your current volunteer experience, from one to ten?  \r\nDo you find your volunteer work at the association impactful?","metadata":{"loc":{"lines":{"from":27,"to":42}}}}],["12",{"pageContent":"How would you rate your current volunteer experience, from one to ten?  \r\nDo you find your volunteer work at the association impactful?\r\nDo you feel like a valued member of our association? Is there any way we could make you feel more appreciated?\r\nDo we offer enough training opportunities, and was our orientation process thorough enough that you feel prepared to do your volunteer duties?\r\nAre there volunteer opportunities we don’t currently offer, but you’d want to participate in?\r\nWhat is the most important work you do for our community through our association?\r\nAre there any needs in our community that our association can work to address?\r\nHas your work contributed to any noticeable results? \r\nOnce you gather your results and analyze the data, you’ll have a keen sense of what motivates your volunteers. You’ll also understand how your association can better support your volunteers.","metadata":{"loc":{"lines":{"from":42,"to":50}}}}],["13",{"pageContent":"Once you gather your results and analyze the data, you’ll have a keen sense of what motivates your volunteers. You’ll also understand how your association can better support your volunteers. \r\nTECH TIP: Utilize Nimble AMS to access the Salesforce AppExchange and apply a survey tool to your Nimble AMS experience. With the power of the Salesforce AppExchange, you can browse from over 7,000 apps and select the best survey solution for your association\r\n\r\n2. Understand volunteer motivation\r\nOnce you get the results from your survey, you’ll have a clearer sense of why your volunteers choose to work. Analyze the survey results and listen to your volunteers’ feedback. Take the survey results and see if you can match your volunteers’ interests with available opportunities within your association. Doing so will ensure volunteer engagement.","metadata":{"loc":{"lines":{"from":50,"to":54}}}}],["14",{"pageContent":"At a most basic level, volunteers give their time because they were asked and/or they want to do good in the community. In the volunteer survey, your members will provide additional reasons that they give their time. These reasons can be divided into the following categories Professional and Personal Motivations.  \r\n\r\nProfessional motivations\r\nIf you have volunteers who are motivated by professional causes, these reasons will likely influence why they donate their time:  \r\n\r\nTo network with their professional community  \r\nTo diversify their current skillset  \r\nTo consider a job change  \r\nTo gain leadership skills  \r\nTo donate their professional skills  \r\nTo serve their industry and local community\r\n\r\nPersonal motivations  \r\nIf your volunteers are moved by personal motivations, they’ll likely be influenced by the following reasons:  \r\n\r\nTo impact their profession and industry  \r\nTo do something different from their job  \r\nTo show commitment to an organization’s mission","metadata":{"loc":{"lines":{"from":56,"to":73}}}}],["15",{"pageContent":"To impact their profession and industry  \r\nTo do something different from their job  \r\nTo show commitment to an organization’s mission  \r\nTo be part of something bigger than themselves  \r\nBecause they were asked to volunteer by a friend or colleague  \r\nTECH TIP: Nimble AMS Predictions has built-in AI and predictive analytics to help you better understand your members' behavior and boost your volunteer engagement strategy.\r\n\r\n\r\n3. Create a volunteer perk program\r\nJumpstart volunteer recruitment and maximize engagement by granting your volunteers professional and personal perks. Consider offering the following benefits to your association volunteers:  \r\n\r\nProfessional perks\r\nLet volunteers promote their company at events  \r\nAllow qualified volunteers to speak at conference sessions and webinars   \r\nHave a volunteer take over your social media once a month  \r\nAllow volunteers to share program updates at a member town hall  \r\nLet qualified volunteers teach professional development sessions","metadata":{"loc":{"lines":{"from":73,"to":89}}}}],["16",{"pageContent":"Have a volunteer take over your social media once a month  \r\nAllow volunteers to share program updates at a member town hall  \r\nLet qualified volunteers teach professional development sessions\r\n\r\nPersonal perks\r\nProvide food and drinks during volunteer hours\r\nReimburse travel costs\r\nCreate and provide volunteer t-shirts\r\nOffer mentor/mentee volunteer programs\r\nProvide an unforgettable experience that impacts your volunteers \r\n\r\nOffering a perk program can provide another reason for volunteers to work at your association and stay engaged. Giving volunteers facetime at member events might also serve as an effective recruitment technique.  \r\n4. Provide volunteer orientation","metadata":{"loc":{"lines":{"from":89,"to":101}}}}],["17",{"pageContent":"4. Provide volunteer orientation\r\nVolunteer orientation is all about educating your members about the mission and goals of your association. The emphasis of orientation should be to help your volunteers learn more about your organization and understand how they fit in. If a volunteer has a clear sense of their role, it’s easier to foster a member’s excitement and maximize volunteer engagement. \r\n\r\nFollow these tips to create a meaningful volunteer orientation and drive member engagement: \r\nDesign an orientation program. Determine how you want to conduct your volunteer orientation. Having in-person orientation is a great way for volunteers to meet and bond, but virtual options are flexible and easy to access for busy volunteers.\r\nCreate an orientation manual. Creating a manual will further solidify your orientation information and compile all presented information in one location. Consider including the following components in your manual:\r\n\r\nAssociation mission statement","metadata":{"loc":{"lines":{"from":101,"to":108}}}}],["18",{"pageContent":"Association mission statement  \r\nList of goals and summary of the long-term plan  \r\nStaff and volunteer directory  \r\nList of Board of Directors and members of other important committees   \r\nAssociation rules, procedures, and expectations for volunteers  \r\nVolunteer check-in system  \r\nReimbursement policy  \r\nTermination policy  \r\n\r\nMake it memorable. To immediately engage your recruits at the start of orientation, try making your approach appealing to all learning styles.Try out these formats in your orientation:  \r\nUse PowerPoint or a similar slide deck to serve as a visual outline of the information you need to cover during your orientation.   \r\nTry gamification to engage your volunteers during the orientation experience.   \r\nInclude times of discussion and allow your volunteers to ask questions.\r\nAdd roleplaying and group activities that allow for team building and friendship forming.","metadata":{"loc":{"lines":{"from":108,"to":121}}}}],["19",{"pageContent":"Include times of discussion and allow your volunteers to ask questions.\r\nAdd roleplaying and group activities that allow for team building and friendship forming. \r\nProvide testimonials about your volunteer program. If possible, bring in veteran volunteers and have them share their experiences.  \r\nMake sure you follow up with your volunteers after orientation. Survey members to see how they felt about the experience and identify any areas where you can improve. Additionally, you’ll want to provide next-step information on where volunteers should report for training. \r\n\r\n\r\n5. Train your volunteers\r\nTraining your volunteers refers to when you cover the role-specific details of their work. If your volunteers are helping staff in their positions, try to have staff train them directly.\r\n\r\nEnsure training includes the following:  \r\n\r\nHow the volunteers should handle their specific tasks  \r\nWhat they should do in an emergency  \r\nWhat are the goals for their position","metadata":{"loc":{"lines":{"from":121,"to":134}}}}],["20",{"pageContent":"Ensure training includes the following:  \r\n\r\nHow the volunteers should handle their specific tasks  \r\nWhat they should do in an emergency  \r\nWhat are the goals for their position  \r\nWhat equipment is required for their role  \r\nA general walkthrough of their tasks\r\n\r\nTo elevate your training process, consider converting your volunteer training to online videos or modules, ensuring easy access for new recruits.   \r\n\r\nTraining can also refer to professional development opportunities within the volunteer program at your association. Whether it’s leadership training or learning a new skill, your volunteers may be motivated to give their time to advance their skill set. Consider offering professional development sessions to help your volunteers earn continuing education credits.  \r\n\r\n6. Leverage an online member community","metadata":{"loc":{"lines":{"from":134,"to":146}}}}],["21",{"pageContent":"6. Leverage an online member community\r\nIt can be a challenge to keep your volunteers engaged outside of their prearranged volunteer hours. Some will only participate in their volunteer hours, while others will choose to engage in additional member programming. By giving volunteers an online community platform, members are more likely to stay engaged.\r\n\r\nHere’s how to design your online community to boost volunteer engagement:   \r\n\r\nIf your association already has an online member community, consider creating different channels or subgroups for your volunteers. Ask the following questions as you build your online community:  \r\n\r\nWho will manage the community? Does your association have a manager to oversee your online community platform? Try selecting one staff member to create and manage community groups. Within the groups themselves, consider selecting a volunteer to lead or manage discussions.","metadata":{"loc":{"lines":{"from":146,"to":153}}}}],["22",{"pageContent":"Do you need to create group descriptions or ground rules? It’s always wise to have reminders of the community’s purpose and reminders to be polite and respectful.\r\nWho else should know about the online community? Chances are you’ll get a lot of great testimonials from your online volunteer group, leading to excellent marketing material. If your volunteers are okay with you sharing their stories, try keeping your entire association in the loop about the latest volunteer project and successes.   \r\n\r\nTo foster your online community, consider creating some basic content to get the discussion going. From there, your volunteers will take over.\r\n\r\nHere’s how: \r\n\r\nMix up the content. Try creating a schedule of content and posting different types depending on the day. Be sure to post different content formats to the online communities too, like videos, gifs, and pictures.","metadata":{"loc":{"lines":{"from":154,"to":161}}}}],["23",{"pageContent":"Promote your online communities. Ensure you invite your volunteers to the online community through email and text. Promote your online community on social media too.\r\nConnect veterans and new volunteers. Foster community within your volunteer program by pairing experienced and new volunteers in a mentoring relationship. Within your online community, create a separate subgroup of veterans and new volunteers to encourage the discussion of personal volunteer experiences and the exchange of ideas for ongoing success. \r\n\r\n7. Recognize your volunteers and their accomplishments\r\nAlways give your volunteers recognition amongst your members. Never assume a volunteer knows you appreciate their hard work. \r\n\r\nHere’s how to show your member volunteers that you care: \r\n\r\nSend thank you’s. Say thank you each time your volunteers dedicate their time to an event or have a weekend board meeting. Say it in person and follow up with a handwritten note or virtual thank you.","metadata":{"loc":{"lines":{"from":162,"to":170}}}}],["24",{"pageContent":"Send thank you’s. Say thank you each time your volunteers dedicate their time to an event or have a weekend board meeting. Say it in person and follow up with a handwritten note or virtual thank you.\r\nRecognize volunteer milestones. You can also recognize your volunteers by celebrating important milestones within your volunteer program. For example, acknowledge your volunteers when they’ve volunteered for six months or hit 100 hours of service. Consider recognizing these milestones at your association’s volunteer thank you party, in association publications, or at member town hall meetings.\r\n\r\nHost a thank you party. Recognize your volunteers formally by hosting an annual party to celebrate their efforts. Provide a meal and consider purchasing gifts to thank your volunteers for their dedication. During the event, allow volunteers to share their favorite memories from their experiences. If possible, have higher-level staff share their thanks with the volunteer group.","metadata":{"loc":{"lines":{"from":170,"to":173}}}}],["25",{"pageContent":"Send birthday greetings. Acknowledge your volunteers by sending birthday greetings. This is an effortless approach to personalizing the volunteer experience at your association. On a volunteer’s birthday, send a handwritten card or personalized email.   \r\nTECH TIP: Use Nimble Create to generate personalized content and thank your volunteers. You can apply easy-to-use templates and automate the thank you email process, saving you time and showing you care about your volunteers.","metadata":{"loc":{"lines":{"from":174,"to":175}}}}],["26",{"pageContent":"Attract early careerists with your online member community\r\nAll of your association members are valuable. They’re what make your association, well, an association. It’s important to engage with all members to drive loyalty and keep your organization thriving.  \r\n\r\nBut let’s focus on your younger members for a minute. Young professionals in your industry represent the next generation of association members. Community Brands research suggests that most members (76%) join as a student, new grad, or within the first five years of employment. Continually attracting this group of early careerists and keeping them engaged is vital to your association’s long-term success. \r\n\r\nLeveraging your online community is the key to attracting and retaining young professionals at your organization. Read on to learn how to boost member engagement with your online community.","metadata":{"loc":{"lines":{"from":1,"to":6}}}}],["27",{"pageContent":"Leveraging your online community is the key to attracting and retaining young professionals at your organization. Read on to learn how to boost member engagement with your online community.\r\n\r\nDo you want to become a trailblazing association? Learn how to use your online community to boost member engagement and attract early careerists. Check out our on-demand webinar: The Future of Association Engagement: Nimble Communities. Watch now.\r\n\r\n5 steps to attract and retain early careerists with your online community\r\n\r\nThe latest Community Brands research discovered 51% of members rely on their professional organization the most for networking, collaboration, sharing ideas, and participating in a professional community. Nearly half of members have used their organization’s online community. Those who have used it report higher loyalty metrics and a strong sense of community versus those who don’t use the online member community.","metadata":{"loc":{"lines":{"from":6,"to":12}}}}],["28",{"pageContent":"Additionally, from the member perspective, email and online community are the top ways members engage with their organization and their top preferred engagement channels. Your online community is already a powerful tool for providing a great member experience. So, a smart way to connect with early careerists is to make your online community even friendlier.  \r\n\r\nFollow these simple, yet effective, tips to make your online community more attractive to young professionals and get them more involved:  \r\n\r\n1. Include relevant content  \r\nCommunity Brands research highlights the differences in what members value based on career stage. Those early in their careers prioritize training, help with career advancement, job opportunities, code of ethics, and fueling industry growth.","metadata":{"loc":{"lines":{"from":14,"to":19}}}}],["29",{"pageContent":"Make sure your online community offers young professionals access to the information that matters most to them, such as career advancement resources and details about upcoming professional development opportunities. Consider creating a subgroup in your online community where members can post job opportunities and members can request more information.  \r\n\r\nWhen you give members access to prioritized resources and offer exclusive and valuable content, you’ll boost member engagement and retention. Plus, housing key content in your online community is an effective way to create conversations, get feedback, and improve member engagement organically. \r\n\r\n2. Create an early careerists subgroup","metadata":{"loc":{"lines":{"from":21,"to":25}}}}],["30",{"pageContent":"2. Create an early careerists subgroup  \r\nCreate a group for early careerists so new members can network, ask questions, and discuss topics with each other. Offering a dedicated space for specific members with similar backgrounds, interests, or professional pursuits will encourage connection and community. Ask an association staff member to participate in the group to help answer questions, direct members to helpful resources, and gather member feedback.\r\n\r\n3. Engage young professionals as leaders in your online community\r\nAsking your younger members to become leaders in your online community has a couple of advantages: \r\n\r\nMembers who participate more tend to feel more engaged. When a member is more engaged, they are more likely to stick around for years to come.\r\nMembers often develop quick connections with their peers. When younger members see their peers participating, they’ll be more likely to join in.","metadata":{"loc":{"lines":{"from":25,"to":32}}}}],["31",{"pageContent":"Members often develop quick connections with their peers. When younger members see their peers participating, they’ll be more likely to join in. \r\n\r\nAsk your member leaders to start conversations in your online community several times a week. These posts might include industry news, a call for suggestions about how to address a challenge, and questions to engage members and keep a discussion flowing.\r\n\r\n4. Reward members for their participation\r\nAs early careerists become more active in your online member community, be sure to reward their involvement. For example, display badges that represent activity and participation levels on member profiles. Gamification through badges can go a long way toward encouraging members to return, share, and connect.\r\n\r\nLevel up your rewards by sending your top participants a handwritten thank you note or giving them a discount code for an upcoming event.\r\n\r\n5. Get feedback","metadata":{"loc":{"lines":{"from":32,"to":41}}}}],["32",{"pageContent":"Level up your rewards by sending your top participants a handwritten thank you note or giving them a discount code for an upcoming event.\r\n\r\n5. Get feedback\r\nThe best way to determine how to make the online community experience better for early careerists is to listen to them. Looking for an easy way to gain member feedback? Leverage your online community to get helpful insights.\r\n\r\nFor example, pay attention to what members are talking about in your online community. Set up online surveys and polls and promote them in posts to the early careerist group. Be sure to have a plan to regularly review feedback and incorporate it into your online community strategy.","metadata":{"loc":{"lines":{"from":41,"to":46}}}}],["33",{"pageContent":"How the Marine Corp Association & Foundation improved member retention with Nimble AMS Predictions and Salesforce Einstein AI\r\nEveryone is talking about Artificial Intelligence (AI). But is your association ready to start leveraging it?\r\n\r\nMore and more organizations are choosing to invest in Artificial Intelligence; however, associations still are slow to embrace this trend. Community Brands research found that only 12% of professional or trade organizations currently have AI or machine learning technology, and only 17% plan on adopting the technology in the future.  \r\n\r\nHow can your association stand out from industry competition and transform your staff and member experience? Embrace Artificial Intelligence today.    \r\n\r\nKeep reading to learn how the Marine Corp Association & Foundation (MCA&F) used Nimble AMS Predictions and Salesforce Einstein AI to boost member retention.","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["34",{"pageContent":"Keep reading to learn how the Marine Corp Association & Foundation (MCA&F) used Nimble AMS Predictions and Salesforce Einstein AI to boost member retention.  \r\nAre you looking to get started with AI? Check out our free toolkit to begin your Artificial Intelligence journey today! Download now.\r\nAbout the Marine Corps Association & Foundation (MCA&F)\r\nThe Marine Corp Association & Foundation (MCA&F) is a member-based organization dedicated to the professional development and recognition of US Marines. In operation for over 100 years, MCA&F works to expand awareness of the rich traditions, history, and spirit of the US Marine Corps. The member base is active duty, retired, and veteran Marines with over 77,000 individuals, providing hundreds of member resources.","metadata":{"loc":{"lines":{"from":8,"to":11}}}}],["35",{"pageContent":"MCA&F has been a Nimble AMS client since 2018. The association appreciates Nimble AMS’ strong reporting and analytics that saves staff time and improves member engagement. Using Nimble AMS makes it easy for MCA&F to integrate with other solutions and have access to the latest innovations like Artificial Intelligence.   \r\n\r\n“We worked with the Nimble AMS team to build an AI-driven solution that automatically identifies members at risk of lapsing, and then helps us take quick action to save the memberships. All of this has led to a return on our investment sooner than we expected,” said Jaclyn Baird, Director of Membership Services MCA&F.\r\n4 steps to use Artificial Intelligence to boost member retention","metadata":{"loc":{"lines":{"from":13,"to":16}}}}],["36",{"pageContent":"4 steps to use Artificial Intelligence to boost member retention\r\nThe Marine Corp Association & Foundation faced a major challenge—the organization experienced 1,000 lapsed members each month. By leveraging Nimble AMS Predictions and Salesforce Einstein AI, MCA&F automatically identified members who were at high risk of lapsing and presented staff with suggested actions to encourage membership renewal.  \r\n\r\nHere are four ways associations can use Artificial Intelligence and predictive analytics to increase member retention and improve the staff and member experience:  \r\n1. Gain more data.\r\nInitially, MCA&F didn’t know why they had 1,000 lapsed members a month. MCA&F didn’t understand the members’ levels of engagement or the reasons why they were leaving. These factors made retention extremely difficult.","metadata":{"loc":{"lines":{"from":16,"to":21}}}}],["37",{"pageContent":"When you choose association management software (AMS) that incorporates Artificial Intelligence, your association can become more data driven. AI makes it easy to learn more about your members, helping associations create future goals.\r\n\r\nNimble AMS Predictions and Einstein AI empower organizations to predict up to 10 scenarios, based on what matters to your association. Determine who’s likely to register for an upcoming conference, which member is likely to donate, who will complete a professional development course, and more.\r\n\r\n2. Streamline manual tasks.\r\nBefore MCA&F started leveraging AI, staff were spending hours on membership renewal tasks. They made hundreds of calls to encourage membership renewal, but a majority of those calls were unsuccessful.","metadata":{"loc":{"lines":{"from":23,"to":28}}}}],["38",{"pageContent":"AI can improve processes and enhance staff productivity. By leveraging AI, MCA&F was able to reduce member and IT staff time by 20 hours. MCA&F leveraged Nimble AMS and Einstein AI to discover patterns of behavior to empower quicker, smarter membership decision making. AI made it easier for staff to know when and how to reach out to members for renewal prior to a lapse.\r\n\r\n3. Revolutionize membership renewal processes.\r\nWhen it came to members renewing, most MCA&F members didn’t renew until they received an invoice. This put many members at risk of lapsing.  \r\n \r\nWith AI, organizations can transform the membership renew process. Rather than waiting to send an invoice or until after a member lapses, AI can help you automate key renewal processes. Leverage AI and your member behavior data to determine which of your members might need additional encouragement to renew.","metadata":{"loc":{"lines":{"from":30,"to":35}}}}],["39",{"pageContent":"Send targeted emails to highlight membership benefits, personalizing the email content based on member data. Additionally, use automated membership renewal emails and invoices to free up staff time so they can offer a more personalized touch to renewal. \r\n4. Build and execute member predictions.\r\nAfter working with the Nimble AMS team, MCA&F decided they needed to be more proactive rather than reactive in its member renewal process. The association decided to set a goal of increasing member retention by 5%.  \r\n \r\nMCA&F leveraged Nimble AMS Predictions and Einstein AI to identify at-risk members and target them with specific renewal actions. Nimble AMS Predictions and Einstein AI made it simple for MCA&F to build member predictions, with a point-and-click builder.","metadata":{"loc":{"lines":{"from":37,"to":41}}}}],["40",{"pageContent":"MCA&F used the prediction wizard to determine how many individuals were likely to lapse their memberships. With the help of the Nimble AMS team, MCA&F created a solution that identified early warning signs for at-risk of lapsing members. Using this AI tool, MCA&F renewed 25% of the members who were at risk of lapsing. \r\n\r\nDid you know? All Nimble AMS users get to try out Nimble AMS Predictions and Einstein AI with one free prediction. Learn more today!\r\n\r\nresource :https://www.nimbleams.com/blog/improve-member-retention-with-artificial-intelligence/","metadata":{"loc":{"lines":{"from":43,"to":47}}}}]]